samples/create_single_send_triggered_send.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Header>
  <wsse:Security
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
     xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <wsu:Timestamp>
    <wsu:Created>2011-02-10T22:41:38Z</wsu:Created>
    <wsu:Expires>2011-02-10T22:46:38Z</wsu:Expires>
   </wsu:Timestamp>
   <wsse:UsernameToken>
    <wsse:Username>*********</wsse:Username>
    <wsse:Password
   Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">*********</wsse:Password>
    <wsse:Nonce>U4yKBl17gHh+I1xtpWCVHNfrVtc=</wsse:Nonce>
    <wsu:Created>2011-02-10T22:41:38Z</wsu:Created>
   </wsse:UsernameToken>
  </wsse:Security>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <CreateRequest
    xmlns="http://exacttarget.com/wsdl/partnerAPI">
   <Options/>
   <ns1:Objects
    xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
     xsi:type="ns1:SMSTriggeredSendDefinition">
    <ns1:Client>
     <ns1:ID>115040</ns1:ID>
    </ns1:Client>
    <ns1:ModifiedDate
     xsi:nil="true"/>
    <ns1:ObjectID
      xsi:nil="true"/>
    <ns1:CustomerKey>12345</ns1:CustomerKey>
    <ns1:Name>SMSTesting12345</ns1:Name>
    <ns1:Publication>
     <ns1:ModifiedDate
      xsi:nil="true"/>
     <ns1:ID>613346</ns1:ID>
     <ns1:ObjectID
      xsi:nil="true"/>
    </ns1:Publication>
    <ns1:DataExtension>
     <ns1:ModifiedDate
      xsi:nil="true"/>
     <ns1:ObjectID
      xsi:nil="true"/>
    </ns1:DataExtension>
    <ns1:Content>
     <ns1:ModifiedDate
      xsi:nil="true"/>
     <ns1:ID>20375</ns1:ID>
     <ns1:ObjectID xsi:nil="true"/>
    </ns1:Content>
    <ns1:SendToList>false</ns1:SendToList>
   </ns1:Objects>
  </CreateRequest>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
